Процедура ЭкспортJson() Экспорт   
	ПутьКФайлу = "D:/crm_14/CRM_14/json/leads.json";
	                                          	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ОткрытьФайл(ПутьКФайлу,,,);
	
	ЗаписьJSON.ЗаписатьНачалоМассива();
	
	Выборка = Справочники.leads.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		
		ЗаписьJSON.ЗаписатьИмяСвойства("lead_id");
		ЗаписьJSON.ЗаписатьЗначение(Выборка.lead_id);
		ЗаписьJSON.ЗаписатьИмяСвойства("current_stage");
		ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(Выборка.stage));
		ЗаписьJSON.ЗаписатьИмяСвойства("source");
		ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(Выборка.source));		
		ЗаписьJSON.ЗаписатьИмяСвойства("owner_fio");
		ЗаписьJSON.ЗаписатьЗначение(Выборка.owner_fio);
		
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		
	КонецЦикла;
	
	ЗаписьJSON.ЗаписатьКонецМассива();
	ЗаписьJSON.Закрыть();
	
КонецПроцедуры