Процедура ПередЗаписью(Отказ, РежимЗаписи)
	
    // Проверка заполненности
    Если ПустаяСтрока(lead_id)или ПустаяСтрока(source)или ПустаяСтрока(stage)или ПустаяСтрока(owner_fio)или ПустаяСтрока(created_at)Тогда
        //Сообщить("все поля обязательны для заполнения.");
        Отказ = Истина;
        Возврат;
	КонецЕсли;
	
	// проверка существования значений           
	
// Если в current_stage попала строка (например, "won"), преобразуем её
//	Если ТипЗнч(current_stage) = Тип("Строка") Тогда
//		
//		ИмяСтадии = СокрЛП(current_stage); // убираем пробелы
//		
//		Попытка
//			// Собираем путь к значению: "Перечисление.ИмяПеречисления.ИмяЗначения"
//			ПутьКЗначению = "Перечисление.current_stage." + ИмяСтадии;
//			ЭтотОбъект.current_stage = ПредопределенноеЗначение(ПутьКЗначению);
//		Исключение
//			// Если в строке пришло что-то, чего нет в Конфигураторе (например "super_won")
//			Сообщить("Ошибка: Стадия '" + ИмяСтадии + "' не найдена в метаданных 1С!");
//			Отказ = Истина;
//		КонецПопытки;
//		
//	КонецЕсли;
КонецПроцедуры