&НаКлиенте
Процедура КнопкаЗагрузить(Команда)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "JSON файл (*.json)|*.json";
	
	Если Диалог.Выбрать() Тогда
			КнопкаЗагрузитьФайл(Диалог.ПолноеИмяФайла);
	КонецЕсли;
КонецПроцедуры  

&НаСервере
Процедура КнопкаЗагрузитьФайл(ВыбранныйПуть)
	ОбъектОбработка = РеквизитФормыВЗначение("Объект");  
	Результат = ОбъектОбработка.ИмпортJson(ВыбранныйПуть);
    Сообщить("Результат обработки: " + Результат);
КонецПроцедуры  