Функция ИмпортJson(ДанныеJSON) Экспорт         
	
	Чтение = Новый ЧтениеJSON;
    Чтение.УстановитьСтроку(ДанныеJSON);
    Данные = ПрочитатьJSON(Чтение);
    Чтение.Закрыть();
	
	Ошибки = Новый Массив;
        
	
	Если ТипЗнч(Данные) = Тип("Массив") Тогда
		Для Каждого ЭлементJSON Из Данные Цикл  
			Попытка
				
				ЛидСсылка = Справочники.leads.НайтиПоРеквизиту("lead_id", ЭлементJSON.lead_id);
		        
				Если ЛидСсылка.Пустая() Тогда    
					НовыйЛидСсылка = ЗаписьВСправочник(ЭлементJSON); 
					ЗаписьВРегистр(НовыйЛидСсылка, ЭлементJSON);
				Иначе 
					ТекСтадия = ЛидСсылка.stage;
					НоваяСтадия = Перечисления.stage[ЭлементJSON.stage];
					
					Если ТекСтадия <> НоваяСтадия Тогда
						ИзменениеВРегистре(ЛидСсылка, ЭлементJSON.created_at); 
						ЗаписьВРегистр(ЛидСсылка, ЭлементJSON);  
						ИзменениеВСправочнике(ЛидСсылка, ЭлементJSON.stage, ЭлементJSON.created_at); 
					КонецЕсли;
				КонецЕсли;
				  
			Исключение          
				ИнфоОшибки = Новый Структура;
				ИнфоОшибки.Вставить("lead_id", ЭлементJSON.lead_id);
				ИнфоОшибки.Вставить("error", ОписаниеОшибки());
				Ошибки.Добавить(ИнфоОшибки); 
				Сообщить("ошибка записи" + ОписаниеОшибки() + ЭлементJSON.lead_id); 
			КонецПопытки;	
	    КонецЦикла;
	КонецЕсли; 
	
	 ПараметрыЗаписи = Новый ПараметрыЗаписиJSON();
	 JSONошибки = Новый ЗаписьJSON;   
	 JSONошибки.УстановитьСтроку(ПараметрыЗаписи);
     ЗаписатьJSON(JSONошибки, Ошибки);
     РезультатJSON = JSONошибки.Закрыть();
	 Возврат РезультатJSON;      
	 
 КонецФункции          
 
Функция ЗаписьВСправочник(ЭлементJSON)
	СпрОбъект = Справочники.leads.СоздатьЭлемент();   
	
	СпрОбъект.Наименование = "Лид № "+ ЭлементJSON.lead_id;
	
	СпрОбъект.lead_id = ЭлементJSON.lead_id;  
				
	СпрОбъект.source = Перечисления.source[ЭлементJSON.source];
	
	СпрОбъект.stage = Перечисления.stage[ЭлементJSON.stage];
	
	СпрОбъект.owner_fio = ЭлементJSON.owner_fio;
	
    СпрОбъект.created_at = ЭлементJSON.created_at;
	
	СпрОбъект.Записать();      
	
	Возврат СпрОбъект.Ссылка;
КонецФункции

Функция ЗаписьВРегистр(ЛидСсылка, ЭлементJSON)  
	РгстрОбъект = РегистрыСведений.lead_stages.СоздатьМенеджерЗаписи();
	
	РгстрОбъект.lead_id = ЛидСсылка; 
	
	РгстрОбъект.stage = Перечисления.stage[ЭлементJSON.stage];  
	
	РгстрОбъект.created_at = ЭлементJSON.created_at;	
	
	РгстрОбъект.left_at = "-";	  
	
	РгстрОбъект.Записать();
КонецФункции  


Функция ИзменениеВРегистре(ЛидСсылка, ДатаJSON) 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ ПЕРВЫЕ 1
    |   lead_stages.stage КАК stage,
	|   lead_stages.created_at КАК created_at
    |ИЗ
    |   РегистрСведений.lead_stages КАК lead_stages
    |ГДЕ
    |   lead_stages.lead_id = &lead_id И lead_stages.left_at = &Тире
    |УПОРЯДОЧИТЬ ПО
    |   lead_stages.created_at УБЫВ"; 
	Запрос.УстановитьПараметр("lead_id", ЛидСсылка); 
	Запрос.УстановитьПараметр("Тире", "-");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
	   
	    МенеджерЗаписи = РегистрыСведений.lead_stages.СоздатьМенеджерЗаписи();
	    МенеджерЗаписи.lead_id = ЛидСсылка; 
		МенеджерЗаписи.created_at = Выборка.created_at; 
		МенеджерЗаписи.stage = Выборка.stage;
	    МенеджерЗаписи.Прочитать();
	    
	    Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.left_at = ДатаJSON;
	        МенеджерЗаписи.Записать();
	    КонецЕсли;
	КонецЕсли;

КонецФункции 

Функция ИзменениеВСправочнике(ЛидСсылка,stage, created_at)   
	
	СпрОбъект = ЛидСсылка.ПолучитьОбъект();
	
	СпрОбъект.stage = Перечисления.stage[stage];
	СпрОбъект.created_at = created_at; 
	
	СпрОбъект.Записать();
	
КонецФункции