Функция ИмпортJson(ПутьКФайлу) Экспорт         
	
	Ошибки = Новый Массив;
	
	//ЗаписьJSON.ЗаписатьНачалоМассива();
	ЛокальныйПуть = ПутьКФайлу;	
	JSONФайл = Новый ЧтениеJSON;
	JSONФайл.ОткрытьФайл(ЛокальныйПуть);
	Данные = ПрочитатьJSON(JSONФайл);
	JSONФайл.Закрыть();        
	
	Если ТипЗнч(Данные) = Тип("Массив") Тогда
		Для Каждого ЭлементJSON Из Данные Цикл  
			Попытка
				
				ЛидСсылка = Справочники.leads.НайтиПоРеквизиту("lead_id", ЭлементJSON.lead_id);
		        
				Если ЛидСсылка.Пустая() Тогда    
					ЗаписьВСправочник(ЭлементJSON); 
					ЗаписьВРегистр(ЭлементJSON);
				Иначе 
					ТекСтадия = ЛидСсылка.stage;
					НоваяСтадия = Перечисления.current_stage[ЭлементJSON.current_stage];
					
					Если ТекСтадия <> НоваяСтадия Тогда
						ИзменениеВРегистре(ЭлементJSON.lead_id, ЭлементJSON.created_at); 
						ЗаписьВРегистр(ЭлементJSON);  
						ИзменениеВСправочнике(ЛидСсылка, ЭлементJSON.current_stage, ЭлементJSON.created_at); 
					КонецЕсли;
				КонецЕсли;
				
				  
			Исключение          
				ИнфоОшибки = Новый Структура;
				ИнфоОшибки.Вставить("lead_id", ЭлементJSON.lead_id);
				ИнфоОшибки.Вставить("error", ОписаниеОшибки());
				Ошибки.Добавить(ИнфоОшибки);
				//Сообщить("ошибка записи" + ОписаниеОшибки()); 
			КонецПопытки;	
	    КонецЦикла;
	КонецЕсли; 
	
	 ПараметрыЗаписи = Новый ПараметрыЗаписиJSON();
	 JSONошибки = Новый ЗаписьJSON;   
	 JSONошибки.УстановитьСтроку(ПараметрыЗаписи);
     ЗаписатьJSON(JSONошибки, Ошибки);
     РезультатJSON = JSONошибки.Закрыть();
	 Возврат РезультатJSON;      
	 
 КонецФункции          
 
 Функция ЗаписьВСправочник(ЭлементJSON)
	СпрОбъект = Справочники.leads.СоздатьЭлемент(); 
	 
	СпрОбъект.lead_id = ЭлементJSON.lead_id;  
				
	СпрОбъект.source = Перечисления.source[ЭлементJSON.source];
	
	СпрОбъект.stage = Перечисления.current_stage[ЭлементJSON.current_stage];
	
	СпрОбъект.owner_fio = ЭлементJSON.owner_fio;
	
    СпрОбъект.created_at = ЭлементJSON.created_at;
	
	СпрОбъект.Записать();
КонецФункции

Функция ЗаписьВРегистр(ЭлементJSON)  
	РгстрОбъект = РегистрыСведений.lead_stages.СоздатьМенеджерЗаписи();
	
	РгстрОбъект.lead_id = ЭлементJSON.lead_id; 
	
	РгстрОбъект.stage = Перечисления.current_stage[ЭлементJSON.current_stage];  
	
	РгстрОбъект.created_at = ЭлементJSON.created_at;	
	
	РгстрОбъект.left_at = "-";	  
	
	РгстрОбъект.Записать();
КонецФункции  

Функция ИзменениеВРегистре(lead_id, ДатаJSON) 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ ПЕРВЫЕ 1
    |   lead_stages.stage КАК stage,
	|   lead_stages.created_at КАК created_at
    |ИЗ
    |   РегистрСведений.lead_stages КАК lead_stages
    |ГДЕ
    |   lead_stages.lead_id = &lead_id И lead_stages.left_at = "-"
    |УПОРЯДОЧИТЬ ПО
    |   lead_stages.created_at УБЫВ"; 
	Запрос.УстановитьПараметр("lead_id", lead_id);
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий() Тогда
	   
	    МенеджерЗаписи = РегистрыСведений.lead_stages.СоздатьМенеджерЗаписи();
	    МенеджерЗаписи.lead_id = lead_id; 
		МенеджерЗаписи.created_at = Выборка.created_at; 
		МенеджерЗаписи.stage = Выборка.stage;
	    МенеджерЗаписи.Прочитать();
	    
	    Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.left_at = ДатаJSON;
	        МенеджерЗаписи.Записать();
	    КонецЕсли;
	КонецЕсли;

КонецФункции   

Функция ИзменениеВСправочнике(ЛидСсылка,current_stage, created_at)   
	
	СпрОбъект = ЛидСсылка.ПолучитьОбъект();
	
	СпрОбъект.stage = Перечисления.current_stage[current_stage];
	СпрОбъект.created_at = created_at; 
	
	СпрОбъект.Записать();
	
КонецФункции