Функция ИмпортJson(ПутьКФайлу) Экспорт         
	
	Ошибки = Новый Массив;
	
	//ЗаписьJSON.ЗаписатьНачалоМассива();
	ЛокальныйПуть = ПутьКФайлу;	
	JSONФайл = Новый ЧтениеJSON;
	JSONФайл.ОткрытьФайл(ЛокальныйПуть);
	Данные = ПрочитатьJSON(JSONФайл);
	JSONФайл.Закрыть();        
	
	Если ТипЗнч(Данные) = Тип("Массив") Тогда
		Для Каждого ЭлементJSON Из Данные Цикл  
			Попытка
				
				СпрСсылка = Справочники.leads.НайтиПоРеквизиту("lead_id", ЭлементJSON.lead_id);
		        
		        Если СпрСсылка.Пустая() Тогда
		           СпрОбъект = Справочники.leads.СоздатьЭлемент();  
			    Иначе 
				   СпрОбъект = СпрСсылка.ПолучитьОбъект();
				КонецЕсли;
				
				СпрОбъект.lead_id = ЭлементJSON.lead_id;  
				
				Источник = ЭлементJSON.source;
				ИсточникПеречисление = Перечисления.source[Источник];
				СпрОбъект.source = ИсточникПеречисление;
				
				Стадия = ЭлементJSON.current_stage;
				СтадияПеречисление = Перечисления.current_stage[Стадия];
				СпрОбъект.current_stage = СтадияПеречисление;
				
				СпрОбъект.owner_fio = ЭлементJSON.owner_fio;
				СтрДата = ЭлементJSON.created_at;
				Если ЗначениеЗаполнено(СтрДата) Тогда						
					День  = Число(Лев(СтрДата, 2));
					Месяц = Число(Сред(СтрДата, 4, 2));
					Год   = Число(Прав(СтрДата, 4));
					СпрОбъект.created_at = Дата(Год, Месяц, День);
				КонецЕсли;
				СпрОбъект.Записать();  
			Исключение          
				ИнфоОшибки = Новый Структура;
				ИнфоОшибки.Вставить("lead_id", ЭлементJSON.lead_id);
				ИнфоОшибки.Вставить("error", ОписаниеОшибки());
				Ошибки.Добавить(ИнфоОшибки);
				//Сообщить("ошибка записи" + ОписаниеОшибки()); 
			КонецПопытки;	
	    КонецЦикла;
	КонецЕсли; 
	
	 ПараметрыЗаписи = Новый ПараметрыЗаписиJSON();
	 JSONошибки = Новый ЗаписьJSON;   
	 JSONошибки.УстановитьСтроку(ПараметрыЗаписи);
     ЗаписатьJSON(JSONошибки, Ошибки);
     РезультатJSON = JSONошибки.Закрыть();
	 Возврат РезультатJSON;      
	 
КонецФункции