Функция methodsleadPost(Запрос) Экспорт
	
	ОбъектИмпорт = Обработки.json_import.Создать();
	
	НовыеЛиды = Запрос.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);  
	
	Ошибки = ОбъектИмпорт.ИмпортJson(НовыеЛиды);
	                             
	Ответ = Новый HTTPСервисОтвет(200);  
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(Ошибки, КодировкаТекста.UTF8);
	Возврат Ответ;
КонецФункции

Функция methodsleadGET(Запрос) Экспорт 
	
    ОбъектЭкспорт = Обработки.json_export.Создать();
	ЛидыJSON = ОбъектЭкспорт.ЭкспортJson(); 
	Ответ = Новый HTTPСервисОтвет(200);  
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(ЛидыJSON);
	Возврат Ответ;           
	
КонецФункции
